Documents/Бронирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Бронирование</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Постоялец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДанныеПостояльцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГостиницы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГостиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/МенеджерЗанятостиНомеров/Ext/Module.bsl
Функция НомерСвободен(НомерГостиницы, НачалоПериода, КонецПериода) Экспорт
		
КонецФункции 


Функция НомерЗанят(НомерГостиницы, НачалоПериода, КонецПериода) Экспорт
		
КонецФункции 


Функция НомерЗабронирован(НомерГостиницы, НачалоПериода, КонецПериода) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронирование.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Бронирование КАК Бронирование
		|ГДЕ
		|	(Бронирование.КонецПериода > &НачалоПериода
		|				И Бронирование.КонецПериода <= &КонецПериода
		|			ИЛИ Бронирование.НачалоПериода >= &НачалоПериода
		|				И Бронирование.НачалоПериода < &КонецПериода)";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.НомерГостиницы = НомерГостиницы Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	Возврат Ложь;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА	
КонецФункции
